//============================================================================
//
// バウンディングボリューム、ヘッダファイル [bouding_volume.h]
// Author : 福田歩希
//
//============================================================================

#ifndef _BOUNDING_VOLUME_H_
#define _BOUNDING_VOLUME_H_	// 二重インクルード防止

////****************************************************
//// ボックス用パラメータの構造体を定義
////****************************************************
//struct Bounding_Box
//{
//	D3DXVECTOR3 Size;	// サイズ
//};

#endif	// _BOUNDING_VOLUME_H_