//============================================================================
//
// キャラクターステート [character_state.cpp]
// Author : 福田歩希
//
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "character_state.h"

//****************************************************
// usingディレクティブ
//****************************************************
using namespace abbr;

//============================================================================
// 
// publicメンバ
// 
//============================================================================

//============================================================================
// コンストラクタ
//============================================================================
CCharacter_State::CCharacter_State() :
	CState{},
	m_pCharacter{ nullptr },
	m_pNextState{ nullptr }
{

}

//============================================================================
// デストラクタ
//============================================================================
CCharacter_State::~CCharacter_State()
{
	if (m_pCharacter != nullptr)
	{
#if 0	// 取得したキャラクターオブジェクトの破棄はオブジェクトクラスに委ねます、ポインタの初期化のみ
		// 終了処理
		m_pCharacter->Uninit();

		// メモリを解放
		delete m_pCharacter;
#endif

		// ポインタを初期化
		m_pCharacter = nullptr;
	}

	if (m_pNextState != nullptr)
	{
#if 0	// 終了時以外にメンバが持つ変更先のステートを解放する場合、状態変更後にダングリングします、変更前にメンバの初期化を行ってください
		// メモリを解放
		delete m_pNextState;
#endif

		// ポインタを初期化
		m_pNextState = nullptr;
	}
}

//============================================================================
// 
// protectedメンバ
// 
//============================================================================

//============================================================================
// 変更予定のステートを取得
//============================================================================
const CCharacter_State* const CCharacter_State::GetNextState() const
{
	return m_pNextState;
}