//============================================================================
//
// フィールドタイプ、ヘッダファイル [field_type.h]
// Author : 福田歩希
//
//============================================================================

#ifndef _FIELD_TYPE_H_
#define _FIELD_TYPE_H_	// 二重インクルード防止

//****************************************************
// フィールドタイプクラス
//****************************************************
class CField_Type
{
public:

	// <special function>
	CField_Type();			// コンストラクタ
	virtual ~CField_Type();	// デストラクタ

	// <function>
	virtual void Update() = 0;	// 更新処理
};

#endif // _FIELD_TYPE_H_