//============================================================================
// 
// フライヤー [flyer.cpp]
// Author : 福田歩希
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "flyer.h"

#include "player.h"

//****************************************************
// usingディレクティブ
//****************************************************
using namespace abbr;

//****************************************************
// 静的メンバ変数の初期化
//****************************************************

// 基礎パラメータの展開
const JSON CFlyer::m_InitParam = utility::OpenJsonFile("Data\\JSON\\CHARACTER\\ENEMY\\flyer_param.json");

//============================================================================
// 
// publicメンバ
// 
//============================================================================

//============================================================================
// コンストラクタ
//============================================================================
CFlyer::CFlyer() :
	CEnemy{},
	m_ActionType{ ACTION::UPDOWN }
{

}

//============================================================================
// デストラクタ
//============================================================================
CFlyer::~CFlyer()
{

}

//============================================================================
// 初期設定
//============================================================================
HRESULT CFlyer::Init()
{
	// エネミークラスの初期設定
	if (FAILED(CEnemy::Init()))
	{
		assert(false && "ゴーストクラスの初期設定に失敗");
	}

	return S_OK;
}

//============================================================================
// 終了処理
//============================================================================
void CFlyer::Uninit()
{
	// エネミークラスの終了処理
	CEnemy::Uninit();
}

//============================================================================
// 更新処理
//============================================================================
void CFlyer::Update()
{
	// 行動分岐
	BranchAction();

	// エネミークラスの更新処理
	CEnemy::Update();
}

//============================================================================
// 描画処理
//============================================================================
void CFlyer::Draw()
{
	// エネミークラスの描画処理
	CEnemy::Draw();
}

//============================================================================
// ダメージを受ける
//============================================================================
void CFlyer::SetDamage(int nDamage)
{
	// ダメージ量分、体力を変動
	int nNewLife = GetLife();
	nNewLife += nDamage;
	SetLife(nNewLife);

	// ライフが無くなったら
	if (nNewLife < 0)
	{
		// アクションタイプを死亡に変更
		m_ActionType = ACTION::DEADEND;
	}
}

//============================================================================
// 生成
//============================================================================
CFlyer* CFlyer::Create()
{
	// インスタンスを生成
	CFlyer* pNewInstance = DBG_NEW CFlyer();

	// タイプを設定
	pNewInstance->CObject::SetType(TYPE::ENEMY);

	// 初期設定
	pNewInstance->Init();

	// モーションをセット
	pNewInstance->CCharacter::SetMotion(utility::OpenJsonFile("Data\\JSON\\CHARACTER\\ENEMY\\flyer_motion.json"));

	{ // パラメータ設定

		// データをキャスト
		int
			nLife = static_cast<int>(m_InitParam["Life"]);
		float
			fCoef = static_cast<float>(m_InitParam["Coef"]),
			fSpeed = static_cast<float>(m_InitParam["Speed"]),
			fRadius = static_cast<float>(m_InitParam["Radius"]),
			fHeight = static_cast<float>(m_InitParam["Height"]);

		// データをセット
		pNewInstance->CCharacter::SetCorrectCoef(fCoef);	// 補間強度
		pNewInstance->CCharacter::SetMoveSpeed(fSpeed);		// 移動速度
		pNewInstance->CCharacter::SetLife(nLife);			// 体力
		pNewInstance->CEnemy::SetBndSize(fRadius, fHeight);	// バウンディングサイズ
	}

	return pNewInstance;
}

//============================================================================
// 
// privateメンバ
// 
//============================================================================

//============================================================================
// 行動分岐
//============================================================================
void CFlyer::BranchAction()
{
	// プレイヤーが存在しなければアクションをしない
	if (!FindPlayer())
		return;

	// タイプに応じて処理を変更
	switch (m_ActionType)
	{
		// 昇降
	case ACTION::UPDOWN:
		UpDown();
		break;

		// 斬撃
	case ACTION::SLASH:
		Slash();
		break;

		// 死亡
	case ACTION::DEADEND:
		DeadEnd();
		break;

		// 例外
	default:
#ifdef _DEBUG
		assert(false && "エネミーの行動に例外発生");
#else
		m_ActionType = ACTION::HOLD;
#endif // _DEBUG
		break;
	}
}

//============================================================================
// 昇降
//============================================================================
void CFlyer::UpDown()
{
	// 待機モーションに変更
	if (GetNowMotion() != 0)
	{
		SetNowMotion(0);
	}

	// 衝突検出
	HitCheck();
}

//============================================================================
// 斬撃
//============================================================================
void CFlyer::Slash()
{

}

//============================================================================
// 死亡
//============================================================================
void CFlyer::DeadEnd()
{
	// 死亡モーションに変更
	if (GetNowMotion() != 2)
	{
		SetNowMotion(2);
	}

	// 死亡モーションの再生が終了したら
	if (GetStopState())
	{
		// 破棄
		SetRelease();
	}
}