//============================================================================
// 
// ゲーム [game.cpp]
// Author : 福田歩希
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "game.h"
#include "fade.h"

// インプット取得用
#include "manager.h"

/* test */
#include "object_3D.h"
#include "object_X.h"
#include "player.h"
#include "texture_manager.h"

#include "field_manager.h"

//****************************************************
// usingディレクティブ
//****************************************************
using namespace field_manager;
using namespace player;

//============================================================================
// デフォルトコンストラクタ
//============================================================================
CGame::CGame()
{

}

//============================================================================
// デストラクタ
//============================================================================
CGame::~CGame()
{

}

//============================================================================
// 初期設定
//============================================================================
HRESULT CGame::Init()
{
	// 基底クラスの初期設定
	HRESULT hr{ CScene::Init() };

	/* プレイヤーを仮生成 */
	CPlayer::Create();

	/* ステージ代わりの円筒 */
	CObject_X* pTest = CObject_X::Create(static_cast<int>(CObject::LAYER::BACK));
	pTest->BindModel(CModel_X_Manager::TYPE::CYLINDER);
	pTest->SetPos({ 0.0f, -10.0f, 0.0f });
	pTest->SetScale(8.5f);

	// フィールドマネージャーの初期設定
	CField_Manager::GetInstance()->Init();

	return hr;
}

//============================================================================
// 終了処理
//============================================================================
void CGame::Uninit()
{
	// フィールドマネージャーの解放
	CField_Manager::GetInstance()->Release();

	// 基底クラスの終了処理
	CScene::Uninit();
}

//============================================================================
// 更新処理
//============================================================================
void CGame::Update()
{
	// フィールドマネージャーの更新
	CField_Manager::GetInstance()->Update();

	// 基底クラスの更新処理
	CScene::Update();

	// リザルト画面へ
	if (CManager::GetKeyboard()->GetTrigger(DIK_RETURN))
	{
		CFade::SetFade(CScene::MODE::RESULT);
	}
}

//============================================================================
// 描画処理
//============================================================================
void CGame::Draw()
{
	// 基底クラスの描画処理
	CScene::Draw();
}