//============================================================================
// 
// ゲーム [game.cpp]
// Author : 福田歩希
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "game.h"
#include "fade.h"

// インプット取得用
#include "manager.h"

/* test */
#include "object_3D.h"
#include "object_X.h"
#include "player.h"
#include "texture_manager.h"

//============================================================================
// デフォルトコンストラクタ
//============================================================================
CGame::CGame()
{

}

//============================================================================
// デストラクタ
//============================================================================
CGame::~CGame()
{

}

//============================================================================
// 初期設定
//============================================================================
HRESULT CGame::Init()
{
	// 基底クラスの初期設定
	HRESULT hr{ CScene::Init() };

	/* プレイヤーを仮生成 */
	CPlayer::Create();

	/* ステージの代わりに円状のポチゴンを表示します */

	CObject_X* pTest{ CObject_X::Create() };
	pTest->BindModel(CModel_X_Manager::TYPE::CYLINDER);
	pTest->SetPos({ 0.0f, -10.0f, 0.0f });
	pTest->SetScale(4.25f);

	//for (int i{ 0 }; i < 200; i++)
	//{
	//	CObject_3D* pTest{ CObject_3D::Create() };
	//	pTest->BindTex(CTexture_Manager::TYPE::TEST1);
	//	pTest->SetPos({ 0.0f, -15.0f, 0.0f });
	//	pTest->SetRot({ 0.0f, 0.0f + 0.1f * i, 0.0f });
	//	pTest->SetSize({ 150.0f, 5.0f, 0.0f });
	//}

	return hr;
}

//============================================================================
// 終了処理
//============================================================================
void CGame::Uninit()
{
	// 基底クラスの終了処理
	CScene::Uninit();
}

//============================================================================
// 更新処理
//============================================================================
void CGame::Update()
{
	// 基底クラスの更新処理
	CScene::Update();

	// リザルト画面へ
	if (CManager::GetKeyboard()->GetTrigger(DIK_RETURN))
	{
		CFade::SetFade(CScene::MODE::RESULT);
	}
}

//============================================================================
// 描画処理
//============================================================================
void CGame::Draw()
{
	// 基底クラスの描画処理
	CScene::Draw();
}