//============================================================================
// 
// ゲーム [game.cpp]
// Author : 福田歩希
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "game.h"
#include "manager.h"
#include "title.h"
#include "result.h"

/* test */
#include "enemy.h"
#include "player.h"
#include "field_manager.h"

//============================================================================
// 
// publicメンバ
// 
//============================================================================

//============================================================================
// 更新処理
//============================================================================
void CGame::Update()
{
	// 基底クラスの更新処理
	CScene::Update();

	// フィールドマネージャーの更新
	CField_Manager::GetInstance()->Update();

	// リザルト画面へ
	if (CManager::GetKeyboard()->GetTrigger(DIK_RETURN))
	{
		To_Next();
	}
#ifdef _DEBUG	// パラメータ確認用
	else if (CManager::GetKeyboard()->GetTrigger(DIK_F7))
	{
		CObject::ReleaseAll();
		CScene_Manager::ChangeScene(CTitle::Create());
	}
#endif // _DEBUG
}

//============================================================================
// 描画処理
//============================================================================
void CGame::Draw()
{
	// 基底クラスの描画処理
	CScene::Draw();

	// フィールドマネージャーの描画
	CField_Manager::GetInstance()->Draw();
}

//============================================================================
// 次のシーンへ
//============================================================================
void CGame::To_Next()
{
	// 全オブジェクトを解放
	CObject::ReleaseAll();

	// リザルトシーンへ変更
	CScene_Manager::ChangeScene(CResult::Create());
}

//============================================================================
// ゲームを生成
//============================================================================
CGame* CGame::Create()
{
	// ゲームを生成
	CGame* pNew = DBG_NEW CGame();

	if (pNew == nullptr)
	{
		assert(false && "ゲームの生成に失敗");
	}

	// ゲームの初期設定
	if (FAILED(pNew->Init()))
	{
		assert(false && "ゲームの初期設定に失敗");
	}

	return pNew;
}

//============================================================================
// 
// protectedメンバ
// 
//============================================================================

//============================================================================
// コンストラクタ
//============================================================================
CGame::CGame() :
	CScene{}
{

}

//============================================================================
// デストラクタ
//============================================================================
CGame::~CGame()
{

}

//============================================================================
// 初期設定
//============================================================================
HRESULT CGame::Init()
{
	// プレイヤーを生成
	CPlayer::Create();

	/* エネミーを仮生成 */
	CEnemy::Create();

	// 環境装飾を生成
	CObject_X::Create(utility::OpenJsonFile("Data\\JSON\\ENVIRONMENT\\statue.json"));
	CObject_X::Create(utility::OpenJsonFile("Data\\JSON\\ENVIRONMENT\\around.json"));

	// フィールドマネージャーの初期設定
	CField_Manager::GetInstance()->Init();

	return S_OK;
}

//============================================================================
// 終了処理
//============================================================================
void CGame::Uninit()
{
	// フィールドマネージャーの解放
	CField_Manager::GetInstance()->Release();
}