//============================================================================
// 
// ゲーム [game.cpp]
// Author : 福田歩希
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "game.h"
#include "fade.h"

// インプット取得用
#include "manager.h"

/* test */
#include "enemy.h"
#include "object_3D.h"
#include "object_X.h"
#include "player.h"
#include "texture_manager.h"

#include "field_manager.h"

//============================================================================
// デフォルトコンストラクタ
//============================================================================
CGame::CGame()
{

}

//============================================================================
// デストラクタ
//============================================================================
CGame::~CGame()
{

}

//============================================================================
// 初期設定
//============================================================================
HRESULT CGame::Init()
{
	// 基底クラスの初期設定
	HRESULT hr = CScene::Init();

	// プレイヤーを生成
	CPlayer::Create();

	/* エネミーを仮生成 */
	//CEnemy::Create();

	// 環境装飾を生成
	CObject_X::Create(utility::OpenJsonFile("Data\\JSON\\ENVIRONMENT\\statue.json"));
	CObject_X::Create(utility::OpenJsonFile("Data\\JSON\\ENVIRONMENT\\around.json"));

	// フィールドマネージャーの初期設定
	CField_Manager::GetInstance()->Init();

	return hr;
}

//============================================================================
// 終了処理
//============================================================================
void CGame::Uninit()
{
	// フィールドマネージャーの解放
	CField_Manager::GetInstance()->Release();

	// 基底クラスの終了処理
	CScene::Uninit();
}

//============================================================================
// 更新処理
//============================================================================
void CGame::Update()
{
	// フィールドマネージャーの更新
	CField_Manager::GetInstance()->Update();

	// 基底クラスの更新処理
	CScene::Update();

	// リザルト画面へ
	if (CManager::GetKeyboard()->GetTrigger(DIK_RETURN))
	{
		CFade::SetFade(CScene::MODE::RESULT);
	}
	else if (CManager::GetKeyboard()->GetTrigger(DIK_F5))
	{
		// パラメータ確認用
		CFade::SetFade(CScene::MODE::TITLE);
	}
}

//============================================================================
// 描画処理
//============================================================================
void CGame::Draw()
{
	// フィールドマネージャーの描画
	CField_Manager::GetInstance()->Draw();

	// 基底クラスの描画処理
	CScene::Draw();
}