//============================================================================
// 
// ゲーム [game.cpp]
// Author : 福田歩希
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "game.h"
#include "manager.h"
#include "result.h"
#include "player.h"
#include "field_manager.h"

//============================================================================
// 
// publicメンバ
// 
//============================================================================

//============================================================================
// 更新処理
//============================================================================
void CGame::Update()
{
	// 基底クラスの更新処理
	CScene::Update();

	// ボス登場カウントをインクリメント
	++DBG_nCntAppearBoss;

	// とりあえず30フレーム経過で
	if (DBG_nCntAppearBoss == 30)
	{
		// ボス登場
		CField_Manager::GetInstance()->AppearBoss();
	}

	// リザルト画面へ
	if (CManager::GetKeyboard()->GetTrigger(DIK_RETURN))
	{
		To_Next();
	}
#ifdef _DEBUG	// パラメータ確認用
	else if (CManager::GetKeyboard()->GetTrigger(DIK_F7))
	{
		CObject::ReleaseAll();
		CField_Manager::Release();
		this->Uninit();
		CField_Manager::Create();
		this->Init();
	}
#endif // _DEBUG
}

//============================================================================
// 描画処理
//============================================================================
void CGame::Draw()
{
	// 基底クラスの描画処理
	CScene::Draw();
}

//============================================================================
// 次のシーンへ
//============================================================================
void CGame::To_Next()
{
	// 全オブジェクトを解放
	CObject::ReleaseAll();

	// リザルトシーンへ変更
	CScene_Manager::ChangeScene(CResult::Create());
}

//============================================================================
// ゲームを生成
//============================================================================
CGame* CGame::Create()
{
	// ゲームを生成
	CGame* pNew = DBG_NEW CGame();

	if (pNew == nullptr)
	{
		assert(false && "ゲームの生成に失敗");
	}

	// ゲームの初期設定
	if (FAILED(pNew->Init()))
	{
		assert(false && "ゲームの初期設定に失敗");
	}

	return pNew;
}

//============================================================================
// 
// protectedメンバ
// 
//============================================================================

//============================================================================
// コンストラクタ
//============================================================================
CGame::CGame() :
	CScene{},
	DBG_nCntAppearBoss{ 0 }
{

}

//============================================================================
// デストラクタ
//============================================================================
CGame::~CGame()
{

}

//============================================================================
// 初期設定
//============================================================================
HRESULT CGame::Init()
{
	// プレイヤーを生成
	CPlayer* pPlayer = CPlayer::Create();

	// プレイヤーをセット
	CField_Manager::GetInstance()->SetPlayer(pPlayer);

	return S_OK;
}

//============================================================================
// 終了処理
//============================================================================
void CGame::Uninit()
{

}