//============================================================================
// 
// HUDオブジェクト [object_HUD.cpp]
// Author : 福田歩希
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "object_HUD.h"

#include "renderer.h"

//****************************************************
// usingディレクティブ
//****************************************************
using namespace abbr;

//============================================================================
// 
// publicメンバ
// 
//============================================================================

//============================================================================
// 描画優先度指定コンストラクタ
//============================================================================
CObject_HUD::CObject_HUD(int nPriority) :
	CObject_2D{ nPriority },
	m_PosTarget{ VEC3_INIT },
	m_RotTarget{ VEC3_INIT },
	m_SizeTarget{ VEC3_INIT },
	m_ColTarget{ XCOL_INIT }
{

}

//============================================================================
// デストラクタ
//============================================================================
CObject_HUD::~CObject_HUD()
{

}

//============================================================================
// 初期設定
//============================================================================
HRESULT CObject_HUD::Init()
{
	// 2Dオブジェクトの初期設定
	if (FAILED(CObject_2D::Init()))
	{
		return E_FAIL;
	}

	return S_OK;
}

//============================================================================
// 終了処理
//============================================================================
void CObject_HUD::Uninit()
{
	// 2Dオブジェクトの終了処理
	CObject_2D::Uninit();
}

//============================================================================
// 更新処理
//============================================================================
void CObject_HUD::Update()
{
	// 目標値への補正
	AdjustToTarget();

	// 2Dオブジェクトの更新処理
	CObject_2D::Update();
}

//============================================================================
// 描画処理
//============================================================================
void CObject_HUD::Draw()
{
	// 2Dオブジェクトの描画処理
	CObject_2D::Draw();
}

//============================================================================
// 目標座標取得
//============================================================================
const D3DXVECTOR3& CObject_HUD::GetPosTarget() const
{
	return m_PosTarget;
}

//============================================================================
// 目標座標設定
//============================================================================
void CObject_HUD::SetPosTarget(D3DXVECTOR3 PosTarget)
{
	m_PosTarget = PosTarget;
}

//============================================================================
// 目標向き取得
//============================================================================
const D3DXVECTOR3& CObject_HUD::GetRotTarget() const
{
	return m_RotTarget;
}

//============================================================================
// 目標向き設定
//============================================================================
void CObject_HUD::SetRotTarget(D3DXVECTOR3 RotTarget)
{
	m_RotTarget = RotTarget;
}

//============================================================================
// 目標サイズ取得
//============================================================================
const D3DXVECTOR3& CObject_HUD::GetSizeTarget() const
{
	return m_SizeTarget;
}

//============================================================================
// 目標サイズ設定
//============================================================================
void CObject_HUD::SetSizeTarget(D3DXVECTOR3 SizeTarget)
{
	m_SizeTarget = SizeTarget;
}

//============================================================================
// 目標色取得
//============================================================================
const D3DXCOLOR& CObject_HUD::GetColTarget() const
{
	return m_ColTarget;
}

//============================================================================
// 目標色設定
//============================================================================
void CObject_HUD::SetColTarget(D3DXCOLOR ColTarget)
{
	m_ColTarget = ColTarget;
}

//============================================================================
// 生成
//============================================================================
CObject_HUD* CObject_HUD::Create()
{
	// インスタンスを生成
	CObject_HUD* pNewInstance = DBG_NEW CObject_HUD();

	// 生成出来ていたら初期設定
	if (pNewInstance == nullptr)
	{
		assert(false && "HUDオブジェクトの生成に失敗");
	}

	// 初期設定
	pNewInstance->Init();

	return pNewInstance;
}

//============================================================================
// 
// privateメンバ
// 
//============================================================================

//============================================================================
// 目標値への補正
//============================================================================
void CObject_HUD::AdjustToTarget()
{
	// 目標座標へ移動
	Vec3 NowPos = GetPos();
	NowPos += (m_PosTarget - NowPos) * COEF_ADJUST;
	SetPos(NowPos);

	// 目標向きへ補正
	Vec3 NowRot = GetRot();
	CUtility::AdjustDirection(m_RotTarget.y, NowRot.y);	// 向きの範囲の補正
	NowRot += (m_RotTarget - NowRot) * COEF_ADJUST;
	SetRot(NowRot);

	// 目標サイズへ補正
	Vec3 NowSize = GetSize();
	NowSize += (m_SizeTarget - NowSize) * COEF_ADJUST;
	SetSize(NowSize);

	// 目標色補正
	XCol NowCol = GetCol();
	NowCol += (m_ColTarget - NowCol) * COEF_ADJUST;
	SetCol(NowCol);
}