////============================================================================
////
//// プレイヤーステートマネージャー、ヘッダファイル [player_state_manager.h]
//// Author : 福田歩希
////
////============================================================================
//
//#ifndef _PLAYER_STATE_MANAGER_H_
//#define _PLAYER_STATE_MANAGER_H_	// 二重インクルード防止
//
////****************************************************
//// 前方宣言
////****************************************************
//class CPlayer_State;
//
////****************************************************
//// 名前空間の定義
////****************************************************
//namespace player_state_manager
//{
//	//****************************************************
//	// usingディレクティブ
//	//****************************************************
//	using namespace abbr;
//
//	//****************************************************
//	// プレイヤーステートマネージャークラス
//	//****************************************************
//	class CPlayer_State_Manager final
//	{
//	public:
//
//		CPlayer_State_Manager();	// デフォルトコンストラクタ
//		~CPlayer_State_Manager();	// デストラクタ
//
//		void Release();				// 破棄
//		void Update();				// 更新処理
//		void CheckChangeState();	// ステートを変更
//
//		static CPlayer_State_Manager* Create();	// 生成
//
//	private:
//
//		HRESULT Init();		// 初期設定
//		void	Uninit();	// 終了設定
//
//		CPlayer_State* m_pState;	// ステート
//	};
//}
//
//#endif	// _PLAYER_STATE_H_