//============================================================================
// 
// プレイヤー [player.cpp]
// Author : 福田歩希
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "player.h"

// インプット取得
#include "manager.h"

// デバッグ表示用
#include "renderer.h"

//****************************************************
// エイリアスを定義
//****************************************************
using Vec = D3DXVECTOR3;

//============================================================================
// 
// publicメンバ
// 
//============================================================================

//============================================================================
// デフォルトコンストラクタ
//============================================================================
CPlayer::CPlayer() :
	m_PosTarget{ D3DXVECTOR3(0.0f, 0.0f, 0.0f) }
{

}

//============================================================================
// デストラクタ
//============================================================================
CPlayer::~CPlayer()
{

}

//============================================================================
// 初期設定
//============================================================================
HRESULT CPlayer::Init()
{
	// 基底クラスの初期設定
	HRESULT hr = CObject_X::Init();

	if (FAILED(hr))
	{
		assert(false && "プレイヤークラスの初期設定に失敗");
	}

	return hr;
}

//============================================================================
// 終了処理
//============================================================================
void CPlayer::Uninit()
{
	// 基底クラスの終了処理
	CObject_X::Uninit();
}

//============================================================================
// 更新処理
//============================================================================
void CPlayer::Update()
{
	// 操作
	Control();

	// 基底クラスの更新処理
	CObject_X::Update();

#ifdef _DEBUG
	CRenderer::GetInstance()->SetDebugString("プレイヤー座標 : " + std::to_string(GetPos().x) + " :  " + std::to_string(GetPos().y) + " : " + std::to_string(GetPos().z));
#endif // _DEBUG
}

//============================================================================
// 描画処理
//============================================================================
void CPlayer::Draw()
{
	// 基底クラスの描画処理
	CObject_X::Draw();
}

//============================================================================
// 目標座標を取得
//============================================================================
Vec CPlayer::GetPosTarget() const
{
	return m_PosTarget;
}

//============================================================================
// 目標座標を設定
//============================================================================
void CPlayer::SetPosTarget(Vec PosTarget)
{
	m_PosTarget = PosTarget;
}

//============================================================================
// 生成
//============================================================================
CPlayer* CPlayer::Create()
{
	// インスタンスを生成
	CPlayer* pNewInstance = DBG_NEW CPlayer();

	// タイプを設定
	pNewInstance->SetType(TYPE::NONE);
	
	// 初期設定
	pNewInstance->Init();

	// モデルを設定
	pNewInstance->BindModel(CModel_X_Manager::TYPE::SAMUS);

	return pNewInstance;
}

//============================================================================
// 
// privateメンバ
// 
//============================================================================

//============================================================================
// 操作
//============================================================================
void CPlayer::Control()
{
	// インプット系取得
	CInputKeyboard* pKeyboard = CManager::GetKeyboard();	// キーボード
	CInputPad* pPad = CManager::GetPad();					// パッド

	// 移動方向用
	bool bMove = false;			// 入力があるか検出
	float X = 0.0f, Y = 0.0f;	// 単位ベクトル用

	// スティックの傾きを取得
	X = pPad->GetJoyStickL().X;
	Y = pPad->GetJoyStickL().Y;

	/* お試し */
	static float f角度 = 0.0f;
	CRenderer::GetInstance()->SetDebugString("プレイヤー座標の角度" + std::to_string(f角度));

	float f増加量 = 0.025f;

	// X軸の入力
	if (pKeyboard->GetPress(DIK_A) || pPad->GetPress(CInputPad::JOYKEY::LEFT))
	{
		X = -1.0f;
		f角度 += -f増加量;
	}
	else if (pKeyboard->GetPress(DIK_D) || pPad->GetPress(CInputPad::JOYKEY::RIGHT))
	{
		X = 1.0f;
		f角度 += f増加量;
	}

	// Y軸の入力
	if (pKeyboard->GetPress(DIK_W) || pPad->GetPress(CInputPad::JOYKEY::UP))
	{
		Y = 1.0f;
	}
	else if (pKeyboard->GetPress(DIK_S) || pPad->GetPress(CInputPad::JOYKEY::DOWN))
	{
		Y = -1.0f;
	}

	// 何か入力していれば移動判定を出す
	if (X != 0.0f || Y != 0.0f)
	{
		bMove = true;
	}

	/* 角度制限 -> 治せ */
	if (f角度 > D3DX_PI)
	{
		f角度 += -D3DX_PI * 2.0f;
	}
	else if (f角度 < -D3DX_PI)
	{
		f角度 += D3DX_PI * 2.0f;
	}

	//if (bMove)
	//{
	//	float f反映量 = 50.0f;

	//	// 座標を反映
	//	Vec NewPos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	//	NewPos.x = cosf(f角度) * f反映量;
	//	NewPos.z = sinf(f角度) * f反映量;
	//	SetPos(NewPos);

	//	// 向きを反映
	//	Vec NewRot = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	//	NewRot.y = f角度 * 0.5f;
	//	SetRot(NewRot);
	//}

	float f反映量 = 150.0f;

	// 座標を反映
	Vec NewPos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	NewPos.x = cosf(f角度) * f反映量;
	NewPos.z = sinf(f角度) * f反映量;
	SetPos(NewPos);

	// 向きを反映
	Vec NewRot = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	NewRot.y = -f角度;
	SetRot(NewRot);
}