//============================================================================
//
// プレイヤー歩行ステート、ヘッダファイル [player_state_walk.h]
// Author : 福田歩希
//
//============================================================================

#ifndef _PLAYER_STATE_WALK_
#define _PLAYER_STATE_WALK_	// 二重インクルード防止

//****************************************************
// インクルードファイル
//****************************************************
#include "player_state.h"

//****************************************************
// プレイヤー歩行ステートクラス
//****************************************************
class CPlayer_State_Walk : public CPlayer_State
{
public:

	CPlayer_State_Walk();			// デフォルトコンストラクタ
	~CPlayer_State_Walk() override;	// デストラクタ

	void Update() override;	// 更新処理
};

#endif	// _PLAYER_STATE_WALK_