//============================================================================
//
// プレイヤージャンプステート [player_state_jump.cpp]
// Author : 福田歩希
//
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "player_state_jump.h"

// 変更先ステート
#include "player_state_default.h"

// フィールド取得用
#include "field_manager.h"

// インプット取得用
#include "manager.h"

//****************************************************
// usingディレクティブ
//****************************************************
using namespace abbr;

//============================================================================
// 
// publicメンバ
// 
//============================================================================

//============================================================================
// デフォルトコンストラクタ
//============================================================================
CPlayer_State_Jump::CPlayer_State_Jump() :
	CPlayer_State{}
{

}

//============================================================================
// デストラクタ
//============================================================================
CPlayer_State_Jump::~CPlayer_State_Jump()
{

}

//============================================================================
// 更新処理
//============================================================================
void CPlayer_State_Jump::Update()
{
	// 間違いなくプレイヤーが着地している場合
	if (m_pCharacter->GetAccelY() == 0.0f)
	{
		// 通常状態へ
		To_Default();
	}

	// 操作
	Control();

	// 重力加速
	m_pCharacter->SetAccelY(m_pCharacter->GetAccelY() + CField_Manager::FIELD_GRAVITY);
}

//============================================================================
// 
// privateメンバ
// 
//============================================================================

//============================================================================
// 操作
//============================================================================
void CPlayer_State_Jump::Control()
{
	// インプット系取得
	CInputKeyboard* pKeyboard = CManager::GetKeyboard();	// キーボード
	CInputPad* pPad = CManager::GetPad();					// パッド

	// プレイヤーのパラメータを取得
	float fDirection = m_pCharacter->GetDirection();		// 方角を取得
	const float& fMoveSpeed = m_pCharacter->GetMoveSpeed();	// 移動速度を取得

	// X軸の入力
	if (pKeyboard->GetPress(DIK_A) || pPad->GetPress(CInputPad::JOYKEY::LEFT) || pPad->GetJoyStickL().X < 0)
	{ // カメラから見て左へ

		// 方角を変動
		fDirection += -fMoveSpeed * 0.5f;
	}
	else if (pKeyboard->GetPress(DIK_D) || pPad->GetPress(CInputPad::JOYKEY::RIGHT) || pPad->GetJoyStickL().X > 0)
	{ // カメラから見て右へ

		 // 方角を変動
		fDirection += fMoveSpeed * 0.5f;
	}

	// 方角を反映
	m_pCharacter->SetDirection(fDirection);
}

//============================================================================
// ステート - 通常状態へ
//============================================================================
void CPlayer_State_Jump::To_Default()
{
	if (GetNextState() == nullptr)
	{
		SetNextState(DBG_NEW CPlayer_State_Default());
	}
}