//============================================================================
//
// プレイヤー通常ステート、ヘッダファイル [player_state_default.h]
// Author : 福田歩希
//
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "state.h"

//****************************************************
// プレイヤー通常ステートクラス
//****************************************************
class CPlayer_State_Default : public CState
{
public:

	CPlayer_State_Default();			// デフォルトコンストラクタ
	~CPlayer_State_Default() override;	// デストラクタ

	void Update() override;	// 更新処理
};