//============================================================================
//
// プレイヤーステート [player_state.cpp]
// Author : 福田歩希
//
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "player_state.h"

//============================================================================
// 
// publicメンバ
// 
//============================================================================

//============================================================================
// デフォルトコンストラクタ
//============================================================================
CPlayer_State::CPlayer_State() :
	CCharacter_State{}
{
	// プレイヤーを取得
	m_pCharacter = RetrievePlayer();
}

//============================================================================
// プレイヤー取得コンストラクタ
//============================================================================
CPlayer_State::CPlayer_State(CPlayer* pPlayer) :
	CCharacter_State{}
{
	if (pPlayer == nullptr)
	{
		assert(false && "プレイヤーステートがプレイヤーを取得失敗");
	}
}

//============================================================================
// デストラクタ
//============================================================================
CPlayer_State::~CPlayer_State()
{
#if 0

	if (m_pNextState != nullptr)
	{
		// メモリを解放
		delete m_pNextState;

		//  ポインタを初期化
		m_pNextState = nullptr;
	}

#endif
}

//============================================================================
// 
// privateメンバ
// 
//============================================================================

//============================================================================
// プレイヤーを取得
//============================================================================
CPlayer* CPlayer_State::RetrievePlayer()
{
	// プレイヤーオブジェクトのポインタを格納
	CPlayer* pPlayer = nullptr;

	// プレイヤーを検索
	if (CObject::FindSpecificObject(CObject::TYPE::PLAYER) != nullptr)
	{
		pPlayer = utility::DownCast(pPlayer, CObject::FindSpecificObject(CObject::TYPE::PLAYER));
	}
	else
	{
		assert(false && "プレイヤーの検索結果がありませんでした");
	}

	return pPlayer;
}