//============================================================================
//
// プレイヤーステート [player_state.cpp]
// Author : 福田歩希
//
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "player_state.h"

//============================================================================
// 
// publicメンバ
// 
//============================================================================

//============================================================================
// デフォルトコンストラクタ
//============================================================================
CPlayer_State::CPlayer_State() :
	CState{},
	m_pPlayer{ nullptr },
	m_pNextState{ nullptr }
{
	// プレイヤーを取得
	m_pPlayer = RetrievePlayer();
}

//============================================================================
// プレイヤー取得コンストラクタ
//============================================================================
CPlayer_State::CPlayer_State(player::CPlayer* pPlayer) :
	CState{},
	m_pPlayer{ pPlayer }
{
	if (pPlayer == nullptr)
	{
		assert(false && "プレイヤーステートがプレイヤーを取得失敗");
	}
}

//============================================================================
// デストラクタ
//============================================================================
CPlayer_State::~CPlayer_State()
{
#if 0	// 
	if (m_pNextState != nullptr)
	{
		// メモリを解放
		delete m_pNextState;

		//  ポインタを初期化
		m_pNextState = nullptr;
	}
#endif
}

//============================================================================
// 次のステートを取得
//============================================================================
CPlayer_State* CPlayer_State::GetNextState()
{
	return m_pNextState;
}

//============================================================================
// 次のステートを設定
//============================================================================
void CPlayer_State::SetNextState(CPlayer_State* pState)
{
	m_pNextState = pState;
}

//============================================================================
// プレイヤーを取得
//============================================================================
player::CPlayer* CPlayer_State::RetrievePlayer()
{
	// プレイヤーを格納
	player::CPlayer* pPlayer = nullptr;

	// プレイヤーを検索
	if (CObject::FindSpecificObject(CObject::TYPE::PLAYER) != nullptr)
	{
		pPlayer = CUtility::DownCast(pPlayer, CObject::FindSpecificObject(CObject::TYPE::PLAYER));
	}
	else
	{
		assert(false && "プレイヤーの検索結果がありませんでした");
	}

	return pPlayer;
}