//============================================================================
// 
// 円柱表示 [render_cylinder.cpp]
// Author : 福田歩希
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "render_cylinder.h"
#include "renderer.h"
#include "object_X.h"

//****************************************************
// usingディレクティブ
//****************************************************
using namespace abbr;

//============================================================================
// 
// publicメンバ
// 
//============================================================================

//============================================================================
// 描画優先度指定コンストラクタ
//============================================================================
CRender_Cylinder::CRender_Cylinder(LAYER Priority) :
	CRender_Collision{ Priority },
	m_fSyncRadius{ 0.0f },
	m_fSyncHeight{ 0.0f },
	m_pCylinderModel{ nullptr }
{
	// 円柱モデルを生成
	m_pCylinderModel = CObject_X::Create(Priority, CX_Manager::TYPE::RENDER_CYLINDER);
}

//============================================================================
// デストラクタ
//============================================================================
CRender_Cylinder::~CRender_Cylinder()
{
	// 円柱モデルを破棄予約
	if (m_pCylinderModel != nullptr)
	{
		m_pCylinderModel->SetRelease();
		m_pCylinderModel = nullptr;
	}
}

//============================================================================
// 初期設定
//============================================================================
HRESULT CRender_Cylinder::Init()
{
	// 判定表示クラスの初期設定
	if (FAILED(CRender_Collision::Init()))
	{
		return E_FAIL;
	}

	// 表示の初期透明度を設定
	m_pCylinderModel->SetCol({ 1.0f, 1.0f, 1.0f, 0.5f });

	// 設定カラーを使用する
	m_pCylinderModel->SetUseCol(true);

	return S_OK;
}

//============================================================================
// 終了処理
//============================================================================
void CRender_Cylinder::Uninit()
{
	// 判定表示クラスの終了処理
	CRender_Collision::Uninit();
}

//============================================================================
// 更新処理
//============================================================================
void CRender_Cylinder::Update()
{
	// バウンディングのサイズに合わせて円柱モデルのスケールをセット
	const Vec3& Scale = { m_fSyncRadius, m_fSyncHeight, m_fSyncRadius };
	m_pCylinderModel->SetScale(Scale);

	// バウンディングの中心点に合わせて円柱モデルの座標をセット
	m_pCylinderModel->SetPos(m_CenterSyncPos);
}

//============================================================================
// 描画処理
//============================================================================
void CRender_Cylinder::Draw()
{
	/* オーバーライド用 */
}

//============================================================================
// シンクロ半径を設定
//============================================================================
void CRender_Cylinder::SetSyncRadius(float fRadius)
{
	m_fSyncRadius = fRadius;
}

//============================================================================
// シンクロ高さを設定
//============================================================================
void CRender_Cylinder::SetSyncHeight(float fHeight)
{
	m_fSyncHeight = fHeight;
}

//============================================================================
// 生成
//============================================================================
CRender_Cylinder* CRender_Cylinder::Create()
{
	// 円柱表示を生成
	CRender_Cylinder* pNew = DBG_NEW CRender_Cylinder(LAYER::FRONT);

	// 生成失敗
	if (pNew == nullptr)
	{
		assert(false && "円柱表示の生成に失敗しました");
	}

	// 円柱表示の初期設定
	pNew->Init();

	return pNew;
}