//============================================================================
// 
// リザルト [result.cpp]
// Author : 福田歩希
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "result.h"
#include "fade.h"

// インプット取得用
#include "manager.h"

/* test */
#include "object_3D.h"
#include "texture_manager.h"

//============================================================================
// コンストラクタ
//============================================================================
CResult::CResult() :
	m_pSpline{nullptr}
{

}

//============================================================================
// デストラクタ
//============================================================================
CResult::~CResult()
{

}

//============================================================================
// 初期設定
//============================================================================
HRESULT CResult::Init()
{
	// 基底クラスの初期設定
	HRESULT hr{ CScene::Init() };

	/* 仮 */
	for (int i{ 0 }; i < 50; i++)
	{
		CObject_3D* pTest{ CObject_3D::Create() };
		pTest->BindTex(CTexture_Manager::TYPE::TEST1);
		pTest->SetPos({ 0.0f, 0.0f, 0.0f });
		pTest->SetRot({ 0.0f, -25.0f + 1.0f * i, 0.0f });
		pTest->SetSize({ 15.0f, 15.0f, 0.0f });
	}

	/* スプラインの初期設定 */
	m_pSpline = DBG_NEW CSpline_Test();
	m_pSpline->Init();

	// 全てのサウンドを停止
	//CSound::GetInstance()->Stop();

	// BGMをかける
	//CSound::GetInstance()->Play(CSound::LABEL::TEST);

	return hr;
}

//============================================================================
// 終了処理
//============================================================================
void CResult::Uninit()
{
	// スプラインの終了処理
	if (m_pSpline != nullptr)
	{
		m_pSpline->Uninit();
		delete m_pSpline;
		m_pSpline = nullptr;
	}

	// 基底クラスの終了処理
	CScene::Uninit();
}

//============================================================================
// 更新処理
//============================================================================
void CResult::Update()
{
	// 基底クラスの更新処理
	CScene::Update();

	// タイトル画面へ
	if (CManager::GetKeyboard()->GetTrigger(DIK_RETURN))
	{
		CFade::SetFade(CScene::MODE::TITLE);
	}
}

//============================================================================
// 描画処理
//============================================================================
void CResult::Draw()
{
	// スプラインの描画処理
	m_pSpline->Draw();

	// 基底クラスの描画処理
	CScene::Draw();
}