////============================================================================
//// 
//// 火の粉、ヘッダファイル [sparks.h]
//// Author : 福田歩希
//// 
////============================================================================
//
//#ifndef _SPARKS_H_
//#define _SPARKS_H_	// 二重インクルード防止
//
////****************************************************
//// インクルードファイル
////****************************************************
//#include "object_billboard.h"
//
////****************************************************
//// 火の粉オブジェクトクラス
////****************************************************
//class CSparks : public CObject_Billboard
//{
//	// <special function>
//	CSparks();				// コンストラクタ
//	~CSparks() override;	// デストラクタ
//
//	// <function>
//	HRESULT Init() override;	// 初期設定
//	void	Uninit() override;	// 終了処理
//	void	Update() override;	// 更新処理
//	void	Draw() override;	// 描画処理
//
//	// 
//};
//
//#endif	// _SPARKS_H_