//============================================================================
//
// ステート、ヘッダファイル [state.h]
// Author : 福田歩希
//
//============================================================================

#ifndef _STATE_H_
#define _STATE_H_	// 二重インクルード防止

//****************************************************
// ステートクラス
//****************************************************
class CState
{
public:

	CState();			// デフォルトコンストラクタ
	virtual ~CState();	// デストラクタ

	virtual void Update() = 0;	// 更新処理
};

#endif	// _STATE_H_